<a href="https://colab.research.google.com/github/parksiwoo1/bmt_python/blob/main/9%EC%A3%BC%EC%B0%A8_%EC%8B%A4%EC%8A%B5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
s=pd.Series([1,3,5,np.nan,6,8])
print(s)

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
type(s)

pandas.core.series.Series

In [8]:
date=pd.date_range('20210507',periods=6)

DatetimeIndex(['2021-05-07', '2021-05-08', '2021-05-09', '2021-05-10',
               '2021-05-11', '2021-05-12'],
              dtype='datetime64[ns]', freq='D')

In [9]:
df=pd.DataFrame(np.random.randn(6,4),)
df

          0         1         2         3
0 -0.199925 -1.414589 -0.515777 -1.741893
1 -0.214268 -1.780297 -1.534800 -0.652030
2 -0.166551  0.435912  1.101605  0.756746
3 -1.302200  1.452315  0.202040 -0.118459
4  0.698396 -0.547982 -0.100378  0.133948
5 -0.625132 -2.421436 -0.498081  1.401301

In [11]:
df=pd.DataFrame(np.random.randn(6,4),index=date,columns=['a','b','c','d'])
df

                   a         b         c         d
2021-05-07  0.106254  0.809017  1.005454 -1.106480
2021-05-08  0.623022  0.141253 -0.076392 -1.695096
2021-05-09 -2.007116  2.572933  1.448690 -1.448474
2021-05-10  0.106090 -0.629466  0.504261 -1.203712
2021-05-11 -0.575697  0.149486  0.383228 -2.001151
2021-05-12  0.085947  0.907920 -0.580848 -0.124595

In [13]:
df=pd.DataFrame(np.random.randn(6,4),index=date,columns=list('국영수물'))
df

                   국         영         수         물
2021-05-07 -0.454645  0.212046  1.167926  0.022142
2021-05-08 -1.726724 -1.322399  0.686342 -1.959882
2021-05-09 -1.287923 -0.819988 -0.018985 -0.231416
2021-05-10  0.656801  0.934164  1.687647  1.485021
2021-05-11 -0.739951  0.486459  0.395688 -0.096201
2021-05-12 -1.281384  0.020331  0.601996 -0.756060

In [21]:
df2 = pd.DataFrame(
    {
        'A': 1.,
        'B': pd.Timestamp('20201113'),
        'C': pd.Series(1, index=list(range(4)), dtype='float32'),
        'D': np.array([3] * 4, dtype='int32'),
        'E': pd.Categorical(["test", "train", "test", "train"]),
        'F': 'foo'
     }
)
df2

     A          B    C  D      E    F
0  1.0 2020-11-13  1.0  3   test  foo
1  1.0 2020-11-13  1.0  3  train  foo
2  1.0 2020-11-13  1.0  3   test  foo
3  1.0 2020-11-13  1.0  3  train  foo

In [24]:
df.tail(3)

                   국         영         수         물
2021-05-10  0.656801  0.934164  1.687647  1.485021
2021-05-11 -0.739951  0.486459  0.395688 -0.096201
2021-05-12 -1.281384  0.020331  0.601996 -0.756060

In [25]:
df.head(3)

                   국         영         수         물
2021-05-07 -0.454645  0.212046  1.167926  0.022142
2021-05-08 -1.726724 -1.322399  0.686342 -1.959882
2021-05-09 -1.287923 -0.819988 -0.018985 -0.231416

In [30]:
df

                   국         영         수         물
2021-05-07 -0.454645  0.212046  1.167926  0.022142
2021-05-08 -1.726724 -1.322399  0.686342 -1.959882
2021-05-09 -1.287923 -0.819988 -0.018985 -0.231416
2021-05-10  0.656801  0.934164  1.687647  1.485021
2021-05-11 -0.739951  0.486459  0.395688 -0.096201
2021-05-12 -1.281384  0.020331  0.601996 -0.756060

In [28]:
df.index

DatetimeIndex(['2021-05-07', '2021-05-08', '2021-05-09', '2021-05-10',
               '2021-05-11', '2021-05-12'],
              dtype='datetime64[ns]', freq='D')

In [29]:
df.columns

Index(['국', '영', '수', '물'], dtype='object')

In [31]:
df.values

array([[-0.45464479,  0.21204606,  1.16792585,  0.02214216],
       [-1.72672369, -1.32239944,  0.68634245, -1.95988175],
       [-1.28792272, -0.81998818, -0.01898465, -0.23141636],
       [ 0.65680098,  0.93416429,  1.68764657,  1.4850213 ],
       [-0.73995056,  0.48645885,  0.39568821, -0.09620103],
       [-1.28138369,  0.02033129,  0.60199565, -0.75606039]])

In [32]:
df.describe()

              국         영         수         물
count  6.000000  6.000000  6.000000  6.000000
mean  -0.805637 -0.081565  0.753436 -0.256066
std    0.845408  0.840938  0.599434  1.121422
min   -1.726724 -1.322399 -0.018985 -1.959882
25%   -1.286288 -0.609908  0.447265 -0.624899
50%   -1.010667  0.116189  0.644169 -0.163809
75%   -0.525971  0.417856  1.047530 -0.007444
max    0.656801  0.934164  1.687647  1.485021

In [33]:
df

                   국         영         수         물
2021-05-07 -0.454645  0.212046  1.167926  0.022142
2021-05-08 -1.726724 -1.322399  0.686342 -1.959882
2021-05-09 -1.287923 -0.819988 -0.018985 -0.231416
2021-05-10  0.656801  0.934164  1.687647  1.485021
2021-05-11 -0.739951  0.486459  0.395688 -0.096201
2021-05-12 -1.281384  0.020331  0.601996 -0.756060

In [34]:
df.T

   2021-05-07  2021-05-08  2021-05-09  2021-05-10  2021-05-11  2021-05-12
국   -0.454645   -1.726724   -1.287923    0.656801   -0.739951   -1.281384
영    0.212046   -1.322399   -0.819988    0.934164    0.486459    0.020331
수    1.167926    0.686342   -0.018985    1.687647    0.395688    0.601996
물    0.022142   -1.959882   -0.231416    1.485021   -0.096201   -0.756060

In [36]:
df

                   국         영         수         물
2021-05-07 -0.454645  0.212046  1.167926  0.022142
2021-05-08 -1.726724 -1.322399  0.686342 -1.959882
2021-05-09 -1.287923 -0.819988 -0.018985 -0.231416
2021-05-10  0.656801  0.934164  1.687647  1.485021
2021-05-11 -0.739951  0.486459  0.395688 -0.096201
2021-05-12 -1.281384  0.020331  0.601996 -0.756060

In [43]:
print(df.sort_index(axis=0,ascending=False))

                   국         영         수         물
2021-05-12 -1.281384  0.020331  0.601996 -0.756060
2021-05-11 -0.739951  0.486459  0.395688 -0.096201
2021-05-10  0.656801  0.934164  1.687647  1.485021
2021-05-09 -1.287923 -0.819988 -0.018985 -0.231416
2021-05-08 -1.726724 -1.322399  0.686342 -1.959882
2021-05-07 -0.454645  0.212046  1.167926  0.022142

In [44]:
print(df.sort_values(by='영'))

                   국         영         수         물
2021-05-08 -1.726724 -1.322399  0.686342 -1.959882
2021-05-09 -1.287923 -0.819988 -0.018985 -0.231416
2021-05-12 -1.281384  0.020331  0.601996 -0.756060
2021-05-07 -0.454645  0.212046  1.167926  0.022142
2021-05-11 -0.739951  0.486459  0.395688 -0.096201
2021-05-10  0.656801  0.934164  1.687647  1.485021

In [49]:
df[['국','영']]

                   국         영
2021-05-07 -0.454645  0.212046
2021-05-08 -1.726724 -1.322399
2021-05-09 -1.287923 -0.819988
2021-05-10  0.656801  0.934164
2021-05-11 -0.739951  0.486459
2021-05-12 -1.281384  0.020331

In [53]:
df[0:3],df[['국','영','수']],df['20210507':'20210509']

(                   국         영         수         물
 2021-05-07 -0.454645  0.212046  1.167926  0.022142
 2021-05-08 -1.726724 -1.322399  0.686342 -1.959882
 2021-05-09 -1.287923 -0.819988 -0.018985 -0.231416,
                    국         영         수
 2021-05-07 -0.454645  0.212046  1.167926
 2021-05-08 -1.726724 -1.322399  0.686342
 2021-05-09 -1.287923 -0.819988 -0.018985
 2021-05-10  0.656801  0.934164  1.687647
 2021-05-11 -0.739951  0.486459  0.395688
 2021-05-12 -1.281384  0.020331  0.601996,
                    국         영         수         물
 2021-05-07 -0.454645  0.212046  1.167926  0.022142
 2021-05-08 -1.726724 -1.322399  0.686342 -1.959882
 2021-05-09 -1.287923 -0.819988 -0.018985 -0.231416)

In [54]:
df.loc['20210507':'20210508',['국','영']]

                   국         영
2021-05-07 -0.454645  0.212046
2021-05-08 -1.726724 -1.322399

In [64]:
df.iloc[1:3,2:3]

                   수
2021-05-08  0.686342
2021-05-09 -0.018985

In [67]:
df.iloc[1,0]

-1.7267236911207424

In [66]:
df

                   국         영         수         물
2021-05-07 -0.454645  0.212046  1.167926  0.022142
2021-05-08 -1.726724 -1.322399  0.686342 -1.959882
2021-05-09 -1.287923 -0.819988 -0.018985 -0.231416
2021-05-10  0.656801  0.934164  1.687647  1.485021
2021-05-11 -0.739951  0.486459  0.395688 -0.096201
2021-05-12 -1.281384  0.020331  0.601996 -0.756060

In [68]:
df.iloc[[1,3],[1,3]]

                   영         물
2021-05-08 -1.322399 -1.959882
2021-05-10  0.934164  1.485021

In [70]:
df.영>0

2021-05-07     True
2021-05-08    False
2021-05-09    False
2021-05-10     True
2021-05-11     True
2021-05-12     True
Freq: D, Name: 영, dtype: bool

In [72]:
df[df>0]

                   국         영         수         물
2021-05-07       NaN  0.212046  1.167926  0.022142
2021-05-08       NaN       NaN  0.686342       NaN
2021-05-09       NaN       NaN       NaN       NaN
2021-05-10  0.656801  0.934164  1.687647  1.485021
2021-05-11       NaN  0.486459  0.395688       NaN
2021-05-12       NaN  0.020331  0.601996       NaN

In [73]:
df2=df.copy()

In [74]:
df2

                   국         영         수         물
2021-05-07 -0.454645  0.212046  1.167926  0.022142
2021-05-08 -1.726724 -1.322399  0.686342 -1.959882
2021-05-09 -1.287923 -0.819988 -0.018985 -0.231416
2021-05-10  0.656801  0.934164  1.687647  1.485021
2021-05-11 -0.739951  0.486459  0.395688 -0.096201
2021-05-12 -1.281384  0.020331  0.601996 -0.756060

In [76]:
df2['E']=['1','2','3','4','5','6']

In [77]:
df2

                   국         영         수         물  E
2021-05-07 -0.454645  0.212046  1.167926  0.022142  1
2021-05-08 -1.726724 -1.322399  0.686342 -1.959882  2
2021-05-09 -1.287923 -0.819988 -0.018985 -0.231416  3
2021-05-10  0.656801  0.934164  1.687647  1.485021  4
2021-05-11 -0.739951  0.486459  0.395688 -0.096201  5
2021-05-12 -1.281384  0.020331  0.601996 -0.756060  6

In [78]:
df2[df2['E'].isin(['2','4'])]

                   국         영         수         물  E
2021-05-08 -1.726724 -1.322399  0.686342 -1.959882  2
2021-05-10  0.656801  0.934164  1.687647  1.485021  4

In [80]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20210507', periods=6))

In [81]:
df['F']=s1

In [82]:
df

                   국         영         수         물  F
2021-05-07 -0.454645  0.212046  1.167926  0.022142  1
2021-05-08 -1.726724 -1.322399  0.686342 -1.959882  2
2021-05-09 -1.287923 -0.819988 -0.018985 -0.231416  3
2021-05-10  0.656801  0.934164  1.687647  1.485021  4
2021-05-11 -0.739951  0.486459  0.395688 -0.096201  5
2021-05-12 -1.281384  0.020331  0.601996 -0.756060  6

In [84]:
df[df>0]=-df

In [85]:
df

                   국         영         수         물  F
2021-05-07 -0.454645 -0.212046 -1.167926 -0.022142 -1
2021-05-08 -1.726724 -1.322399 -0.686342 -1.959882 -2
2021-05-09 -1.287923 -0.819988 -0.018985 -0.231416 -3
2021-05-10 -0.656801 -0.934164 -1.687647 -1.485021 -4
2021-05-11 -0.739951 -0.486459 -0.395688 -0.096201 -5
2021-05-12 -1.281384 -0.020331 -0.601996 -0.756060 -6